w_commands/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2025-10-21 Tue 06:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux commands</title>
<meta name="author" content="Shigeto R. Nishitani" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">linux commands</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org54526dc">1. unix command table</a></li>
<li><a href="#orgf483362">2. example</a></li>
<li><a href="#org6728c7d">3. manページ@wikipedia</a></li>
<li><a href="#org3ef4bf6">4. Unixコマンド</a>
<ul>
<li><a href="#org06b867b">4.1. ファイルとファイルシステム管理</a></li>
<li><a href="#org0453ac0">4.2. プロセス管理</a></li>
<li><a href="#org95ea3cf">4.3. ユーザ管理/環境</a></li>
<li><a href="#orga4fb18b">4.4. テキスト処理</a></li>
<li><a href="#orge14b599">4.5. シェルビルトイン</a></li>
<li><a href="#orgb8a366e">4.6. 通信</a></li>
<li><a href="#org7f2bd15">4.7. マニュアル</a></li>
<li><a href="#orgdd08f3f">4.8. ソフトウェア開発</a></li>
<li><a href="#orgbbdc329">4.9. その他</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org54526dc" class="outline-2">
<h2 id="org54526dc"><span class="section-number-2">1.</span> unix command table</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">分類</td>
<td class="org-left">通常使用</td>
<td class="org-left">new commers</td>
</tr>

<tr>
<td class="org-left">ファイル</td>
<td class="org-left">cat chmod chown cp ln ls mkdir mv pwd rm touch</td>
<td class="org-left">tree bat</td>
</tr>

<tr>
<td class="org-left">シェルビルトイン</td>
<td class="org-left">cd echo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">プロセス管理</td>
<td class="org-left">bg fg kill ps top</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">テキスト処理</td>
<td class="org-left">diff head less more wc xargs</td>
<td class="org-left">delta emacs code</td>
</tr>

<tr>
<td class="org-left">検索</td>
<td class="org-left">find grep whereis</td>
<td class="org-left">fd</td>
</tr>

<tr>
<td class="org-left">ソフトウェア開発</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">git rake</td>
</tr>

<tr>
<td class="org-left">その他</td>
<td class="org-left">date</td>
<td class="org-left">apt brew gem pip</td>
</tr>

<tr>
<td class="org-left">ユーザ管理/環境</td>
<td class="org-left">exit history sudo whoami</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">マニュアル</td>
<td class="org-left">man</td>
<td class="org-left">tldr</td>
</tr>

<tr>
<td class="org-left">通信</td>
<td class="org-left">ssh</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf483362" class="outline-2">
<h2 id="orgf483362"><span class="section-number-2">2.</span> example</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>du |sort -nr |head</li>
<li>ps -ax |grep emacs</li>
</ul>
</div>
</div>
<div id="outline-container-org6728c7d" class="outline-2">
<h2 id="org6728c7d"><span class="section-number-2">3.</span> <a href="https://ja.wikipedia.org/wiki/Man%E3%83%9A%E3%83%BC%E3%82%B8">manページ@wikipedia</a></h2>
</div>

<div id="outline-container-org3ef4bf6" class="outline-2">
<h2 id="org3ef4bf6"><span class="section-number-2">4.</span> Unixコマンド</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org06b867b" class="outline-3">
<h3 id="org06b867b"><span class="section-number-3">4.1.</span> ファイルとファイルシステム管理</h3>
<div class="outline-text-3" id="text-4-1">
<p>
cat chattr chmod chown chgrp cksum cmp cp dd du df file fsck fuser ln ls lsof mkdir mount mv pax pwd rm rmdir size split tee touch type umask 
</p>
</div>
</div>
<div id="outline-container-org0453ac0" class="outline-3">
<h3 id="org0453ac0"><span class="section-number-3">4.2.</span> プロセス管理</h3>
<div class="outline-text-3" id="text-4-2">
<p>
at bg chroot cron fg kill killall nice pgrep pidof pkill ps pstree reboot shutdown time top
</p>
</div>
</div>
<div id="outline-container-org95ea3cf" class="outline-3">
<h3 id="org95ea3cf"><span class="section-number-3">4.3.</span> ユーザ管理/環境</h3>
<div class="outline-text-3" id="text-4-3">
<p>
clear env exit finger history id logname mesg passwd su sudo uptime talkt put uname w wall who whoami write
</p>
</div>
</div>
<div id="outline-container-orga4fb18b" class="outline-3">
<h3 id="orga4fb18b"><span class="section-number-3">4.4.</span> テキスト処理</h3>
<div class="outline-text-3" id="text-4-4">
<p>
awk banner basename comm csplit cut diff dirname ed ex fmt fold head iconv join less m4 more nkf nl paste patch printf read sed sort spell strings tail tr troff uniq vi wc xargs yes
</p>
</div>
</div>
<div id="outline-container-orge14b599" class="outline-3">
<h3 id="orge14b599"><span class="section-number-3">4.5.</span> シェルビルトイン</h3>
<div class="outline-text-3" id="text-4-5">
<p>
alias cd echo test unset wait
</p>
</div>
</div>
<div id="outline-container-orgb8a366e" class="outline-3">
<h3 id="orgb8a366e"><span class="section-number-3">4.6.</span> 通信</h3>
<div class="outline-text-3" id="text-4-6">
<p>
dighost ifconfig inetd ip (iproute2) netcat netstat nslookup ping rdate rlogin route ssh trace route
検索	
find grep locate whatis whereis 
</p>
</div>
</div>
<div id="outline-container-org7f2bd15" class="outline-3">
<h3 id="org7f2bd15"><span class="section-number-3">4.7.</span> マニュアル</h3>
<div class="outline-text-3" id="text-4-7">
<p>
apropos help man
</p>
</div>
</div>
<div id="outline-container-orgdd08f3f" class="outline-3">
<h3 id="orgdd08f3f"><span class="section-number-3">4.8.</span> ソフトウェア開発</h3>
<div class="outline-text-3" id="text-4-8">
<p>
ar ctags lex make nm strip yacc
</p>
</div>
</div>
<div id="outline-container-orgbbdc329" class="outline-3">
<h3 id="orgbbdc329"><span class="section-number-3">4.9.</span> その他</h3>
<div class="outline-text-3" id="text-4-9">
<p>
bc dc cal date expr false lp lpr od sl sleep stty true tty
</p>

<p>
Category:UNIXのソフトウェアUNIXユーティリティの一覧
</p>

<p>
この記事は2008年11月1日以前にFree On-line Dictionary of Computingから取得した項目の資料を元に、GFDL バージョン1.3以降の「RELICENSING」(再ライセンス) 条件に基づいて組み込まれている。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2025-10-21 Tue 06:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
